apache/nuttx/arch/xtensa/src/esp32/esp32_pm.c
  if (sdio_conf_reg & RTC_CNTL_SDIO_FORCE)
    {
      /* Get configuration from RTC */

      result->force = 1;
      result->enable = (sdio_conf_reg & RTC_CNTL_XPD_SDIO_REG_M)
                                      >> RTC_CNTL_XPD_SDIO_REG_S;
      result->tieh = (sdio_conf_reg & RTC_CNTL_SDIO_TIEH_M)
                                      >> RTC_CNTL_SDIO_TIEH_S;

      return OK;
    }

  efuse_reg = getreg32(EFUSE_BLK0_RDATA4_REG);

  if (efuse_reg & EFUSE_RD_XPD_SDIO_FORCE)
    {
      /* Get configuration from EFUSE */

      result->force = 0;
      result->enable = (efuse_reg & EFUSE_RD_XPD_SDIO_REG_M)
                                  >> EFUSE_RD_XPD_SDIO_REG_S;
      result->tieh = (efuse_reg & EFUSE_RD_XPD_SDIO_TIEH_M)
                                >> EFUSE_RD_XPD_SDIO_TIEH_S;

      if (REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG,
              EFUSE_RD_BLK3_PART_RESERVE) == 0)
        {
          result->drefh = (efuse_reg >> 8) & 0x3;
          result->drefm = (efuse_reg >> 10) & 0x3;
          result->drefl = (efuse_reg >> 12) & 0x3;
        }

      return OK;
    }

  /* Otherwise, VDD_SDIO is controlled by bootstrapping pin */

  strap_reg = getreg32(GPIO_STRAP_REG);
  result->force = 0;
  result->tieh = (strap_reg & BIT(5)) ? RTC_VDDSDIO_TIEH_1_8V
                                      : RTC_VDDSDIO_TIEH_3_3V;
  result->enable = 1;

  return OK;
}

/****************************************************************************
 * Name: esp32_sleep_start
 *
 * Description:
 *   Enter low power mode.
 *
 * Input Parameters:
 *   Power domains
 *
 * Returned Value:
 *   0 is returned on success or a negated errno value is returned
 *
 ****************************************************************************/

static int IRAM_ATTR esp32_sleep_start(uint32_t pd_flags)
{
  int result;
  uint32_t cur_freq;

  /* Stop UART output so that output is not lost due to APB frequency change.
   * For light sleep, suspend UART output - it will resume after wakeup.
   * For deep sleep, wait for the contents of UART FIFO to be sent.
   */

  if (pd_flags & RTC_SLEEP_PD_DIG)
    {
      esp32_flush_uarts();
    }
  else
    {
      esp32_suspend_uarts();
    }

  /* Save current frequency and switch to XTAL */

  cur_freq = esp_rtc_clk_get_cpu_freq();
  esp32_rtc_cpu_freq_set_xtal();

  /* Enter sleep */

  esp32_rtc_sleep_init(pd_flags);

  /* Configure timer wakeup */

  if ((s_config.wakeup_triggers & RTC_TIMER_TRIG_EN)
                     && s_config.sleep_duration > 0)
    {
      esp32_timer_wakeup_prepare();
    }

  result = esp32_rtc_sleep_start(s_config.wakeup_triggers, 0);

  /* Restore CPU frequency */

  if (esp32_configure_cpu_freq(cur_freq) != OK)
    {
      pwrwarn("WARNING: Failed to restore CPU frequency"
              "Configure cpu frequency %" PRIu32 ".\n", cur_freq);
    }

  /* Re-enable UART output */

  esp32_resume_uarts();

  return result;
}

/****************************************************************************
 * Name: esp32_light_sleep_inner
 *
 * Description:
 *   Enter low power mode, then wait for flash to be ready on wakeup
 *
 * Input Parameters:
 *   pd_flags - Power domains
 *   time_us  - Time to wait for spi_flash become ready
 *   config   -  VDDSDIO configuration
 *
 * Returned Value:
 *   0 is returned on success or a negated errno value is returned
 *
 ****************************************************************************/

int esp32_light_sleep_inner(uint32_t pd_flags,
        uint32_t time_us, struct rtc_vddsdio_config_s config)
{
  /* Enter sleep */

  int err = esp32_sleep_start(pd_flags);

  /* If VDDSDIO regulator was controlled by RTC registers before sleep.
   * restore the configuration.
   */

  if (config.force)
    {
      esp32_set_vddsdio_config(config);
    }

  /* If SPI flash was powered down, wait for it to become ready. */

  if (pd_flags & RTC_SLEEP_PD_VDDSDIO)
    {
      /* Wait for the flash chip to start up. */

      ets_delay_us(time_us);
    }

  return err;
}

/****************************************************************************
 * Name: esp32_configure_cpu_freq
 *
 * Description:
 *   Switch to new CPU frequencies.
 *
 * Input Parameters:
 *   cpu_freq_mhz - new CPU frequency
 *
 * Returned Value:
 *   0 is returned on success or a negated errno value is returned
 *
 ****************************************************************************/

static int IRAM_ATTR esp32_configure_cpu_freq(uint32_t cpu_freq_mhz)
{
  uint32_t soc_clk_sel;
  uint32_t source_freq_mhz;
  enum esp32_rtc_xtal_freq_e xtal_freq;

  if (cpu_freq_mhz == 240)
    {
      source_freq_mhz = RTC_PLL_FREQ_480M;
    }
  else if(cpu_freq_mhz == 80 || cpu_freq_mhz == 160)
    {
      source_freq_mhz = RTC_PLL_FREQ_320M;
    }
  else
    {
      return -EINVAL;
    }

  xtal_freq = esp32_rtc_clk_xtal_freq_get();
  soc_clk_sel = REG_GET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_SOC_CLK_SEL);

  if (soc_clk_sel != RTC_CNTL_SOC_CLK_SEL_XTL)
    {
      esp32_rtc_update_to_xtal(xtal_freq, 1);
      esp32_rtc_wait_for_slow_cycle();
    }

  if (soc_clk_sel == RTC_CNTL_SOC_CLK_SEL_PLL)
    {
      esp32_rtc_bbpll_disable();
    }

  esp32_rtc_bbpll_enable();
  esp32_rtc_wait_for_slow_cycle();
  esp32_rtc_bbpll_configure(xtal_freq, source_freq_mhz);
  esp32_set_cpu_freq(cpu_freq_mhz);

  return OK;
}

/****************************************************************************
 * Name:  esp32_ptr_executable
 *
 * Description:
 *   Check if point p in a compatible memory area of IRAM
 *
 * Input Parameters:
 *   p - Memory address
 *
 * Returned Value:
 *    True if in memory area or false if not.
 *
 ****************************************************************************/

static inline bool IRAM_ATTR esp32_ptr_executable(const void *p)
{
  intptr_t ip = (intptr_t) p;

  return (ip >= SOC_IROM_LOW && ip < SOC_IROM_HIGH)
        || (ip >= SOC_IRAM_LOW && ip < SOC_IRAM_HIGH)
        || (ip >= SOC_IROM_MASK_LOW && ip < SOC_IROM_MASK_HIGH)
#if defined(SOC_CACHE_APP_LOW)
        || (ip >= SOC_CACHE_APP_LOW && ip < SOC_CACHE_APP_HIGH)
#endif
        || (ip >= SOC_RTC_IRAM_LOW && ip < SOC_RTC_IRAM_HIGH);
}

/****************************************************************************
 * Name:  esp32_set_deep_sleep_wake_stub
 *
 * Description:
 *   Install a new stub at runtime to run on wake from deep sleep.
 *
 * Input Parameters:
 *   new_stub - Function type for stub to run on wake from sleep
 *
 * Returned Value:
 *    None.
 *
 ****************************************************************************/

static void esp32_set_deep_sleep_wake_stub(
                      esp_deep_sleep_wake_stub_fn_t new_stub)
{
  putreg32((uint32_t)new_stub, RTC_ENTRY_ADDR_REG);
  set_rtc_memory_crc();
}

/****************************************************************************
 * Name:  esp32_get_deep_sleep_wake_stub
 *
 * Description:
 *   Get current wake from deep sleep stub.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *    Current wake from deep sleep stub, or NULL if no stub is installed.
 *
 ****************************************************************************/

