apache/nuttx/arch/xtensa/src/esp32/esp32_pm.c
static esp_deep_sleep_wake_stub_fn_t esp32_get_deep_sleep_wake_stub(void)
{
  uint32_t stored_crc = 0;
  uint32_t calc_crc = 0;
  esp_deep_sleep_wake_stub_fn_t stub_ptr = NULL;

  stored_crc = getreg32(RTC_MEMORY_CRC_REG);
  set_rtc_memory_crc();
  calc_crc = getreg32(RTC_MEMORY_CRC_REG);
  putreg32(stored_crc, RTC_MEMORY_CRC_REG);

  if (stored_crc != calc_crc)
    {
      return NULL;
    }

  stub_ptr = (esp_deep_sleep_wake_stub_fn_t) getreg32(RTC_ENTRY_ADDR_REG);
  if (!esp32_ptr_executable(stub_ptr))
    {
      return NULL;
    }

  return stub_ptr;
}

/****************************************************************************
 * Name:  esp32_wake_deep_sleep
 *
 * Description:
 *   Default stub to run on wake from deep sleep.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *    None
 *
 ****************************************************************************/

static void RTC_IRAM_ATTR esp32_wake_deep_sleep(void)
{
  /* Clear MMU for CPU 0 */

  putreg32(getreg32(DPORT_PRO_CACHE_CTRL1_REG) | DPORT_PRO_CACHE_MMU_IA_CLR,
                    DPORT_PRO_CACHE_CTRL1_REG);
  putreg32(getreg32(DPORT_PRO_CACHE_CTRL1_REG) &
                   (~DPORT_PRO_CACHE_MMU_IA_CLR), DPORT_PRO_CACHE_CTRL1_REG);

#if ESP32_DEEP_SLEEP_WAKEUP_DELAY > 0
  /* ROM code has not started yet, so we need to set delay factor
   * used by ets_delay_us first.
   */

  ets_update_cpu_frequency_rom(ets_get_detected_xtal_freq() / 1000000);

  /* This delay is configured in menuconfig, it can be used to give
   * the flash chip some time to become ready.
   */

  ets_delay_us(ESP32_DEEP_SLEEP_WAKEUP_DELAY);
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:  esp32_sleep_enable_timer_wakeup
 *
 * Description:
 *   Configure wake-up interval
 *
 * Input Parameters:
 *   time_in_us - Configure wake-up time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32_sleep_enable_timer_wakeup(uint64_t time_in_us)
{
  s_config.wakeup_triggers |= RTC_TIMER_TRIG_EN;
  s_config.sleep_duration = time_in_us;
}

/****************************************************************************
 * Name:  esp32_light_sleep_start
 *
 * Description:
 *   Enter sleep mode
 *
 * Input Parameters:
 *   sleep_time - Actual sleep time
 *
 * Returned Value:
 *   0 is returned on success or a negated errno value is returned
 *
 ****************************************************************************/

int esp32_light_sleep_start(uint64_t *sleep_time)
{
  irqstate_t flags;
  uint32_t pd_flags;
  uint32_t flash_enable_time_us;
#ifndef CONFIG_ESP32_SPIRAM
  uint32_t vddsdio_pd_sleep_duration;
#endif
  struct rtc_vddsdio_config_s vddsdio_config;
  int ret = OK;

  flags = enter_critical_section();
  s_config.rtc_ticks_at_sleep_start = esp32_rtc_time_get();

  /* Decide which power domains can be powered down */

  pd_flags = esp32_get_power_down_flags();

  /* Amount of time to subtract from actual sleep time.
   * This is spent on entering and leaving light sleep.
   */

  s_config.sleep_time_adjustment = LIGHT_SLEEP_TIME_OVERHEAD_US;

  /* Decide if VDD_SDIO needs to be powered down;
   * If it needs to be powered down, adjust sleep time.
   */

  flash_enable_time_us = VDD_SDIO_POWERUP_TO_FLASH_READ_US
                         + ESP32_DEEP_SLEEP_WAKEUP_DELAY;

#ifndef CONFIG_ESP32_SPIRAM
  vddsdio_pd_sleep_duration = MAX(FLASH_PD_MIN_SLEEP_TIME_US,
              flash_enable_time_us + LIGHT_SLEEP_TIME_OVERHEAD_US
                                        + LIGHT_SLEEP_MIN_TIME_US);

  if (s_config.sleep_duration > vddsdio_pd_sleep_duration)
    {
      pd_flags |= RTC_SLEEP_PD_VDDSDIO;
      s_config.sleep_time_adjustment += flash_enable_time_us;
    }
#endif

  esp32_get_vddsdio_config(&vddsdio_config);

  /* Enter sleep, then wait for flash to be ready on wakeup */

  ret = esp32_light_sleep_inner(pd_flags, flash_enable_time_us,
                                               vddsdio_config);
  if (sleep_time != NULL)
    {
      *sleep_time = esp32_rtc_time_slowclk_to_us(esp32_rtc_time_get() -
          s_config.rtc_ticks_at_sleep_start, esp32_clk_slowclk_cal_get());
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: esp32_pminit
 *
 * Description:
 *   Initialize force sleep parameters.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_pminit(void)
{
  /* Initialize RTC parameters */

  esp32_rtc_init();
  esp32_rtc_clk_set();
}

/****************************************************************************
 * Name: esp32_pmstandby
 *
 * Description:
 *   Enter force sleep.
 *
 * Input Parameters:
 *   time_in_us - force sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_pmstandby(uint64_t time_in_us)
{
  uint64_t rtc_diff_us;
#ifdef CONFIG_ESP32_RT_TIMER
  uint64_t hw_start_us;
  uint64_t hw_end_us;
  uint64_t hw_diff_us;
#endif

  /* don't power down XTAL - powering it up takes different time on. */

  esp32_sleep_enable_timer_wakeup(time_in_us);

#ifdef CONFIG_ESP32_RT_TIMER
  /* Get rt-timer timestamp before entering sleep */

  hw_start_us = rt_timer_time_us();
#endif

  esp32_light_sleep_start(&rtc_diff_us);

#ifdef CONFIG_ESP32_RT_TIMER
  /* Get rt-timer timestamp after waking up from sleep */

  hw_end_us = rt_timer_time_us();
  hw_diff_us = hw_end_us - hw_start_us;
  DEBUGASSERT(rtc_diff_us > hw_diff_us);

  rt_timer_calibration(rtc_diff_us - hw_diff_us);
#endif

#ifdef CONFIG_SCHED_TICKLESS
  up_step_idletime((uint32_t)time_in_us);
#endif

  pwrinfo("Returned from auto-sleep, slept for %" PRIu32 " ms\n",
            (uint32_t)(rtc_diff_us) / 1000);
}

/****************************************************************************
 * Name: esp32_sleep_get_wakeup_cause
 *
 * Description:
 *   Get the wakeup source which caused wakeup from sleep.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Cause of wake up from last sleep
 *   (one of enum esp32_sleep_source_e values).
 *
 ****************************************************************************/

