apache/nuttx/arch/xtensa/src/esp32/esp32_pm.c
enum esp32_sleep_source_e esp32_sleep_get_wakeup_cause(void)
{
  uint32_t wakeup_cause;
  if (esp32_resetcause(0) != ESP32_RESETCAUSE_CORE_DPSP)
    {
      return ESP_SLEEP_WAKEUP_UNDEFINED;
    }

  wakeup_cause = REG_GET_FIELD(RTC_CNTL_WAKEUP_STATE_REG,
                                    RTC_CNTL_WAKEUP_CAUSE);
  if (wakeup_cause & RTC_EXT0_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_EXT0;
    }
  else if (wakeup_cause & RTC_EXT1_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_EXT1;
    }
  else if (wakeup_cause & RTC_TIMER_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_TIMER;
    }
  else if (wakeup_cause & RTC_TOUCH_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_TOUCHPAD;
    }
  else if (wakeup_cause & RTC_ULP_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_ULP;
    }
  else if (wakeup_cause & RTC_GPIO_TRIG_EN)
    {
      return ESP_SLEEP_WAKEUP_GPIO;
    }
  else if (wakeup_cause & (RTC_UART0_TRIG_EN | RTC_UART1_TRIG_EN))
    {
      return ESP_SLEEP_WAKEUP_UART;
    }
  else
    {
      return ESP_SLEEP_WAKEUP_UNDEFINED;
    }
}

/****************************************************************************
 * Name:  esp32_deep_sleep_start
 *
 * Description:
 *   Enter deep sleep mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_deep_sleep_start(void)
{
  uint32_t pd_flags;

  /* record current RTC time */

  s_config.rtc_ticks_at_sleep_start = esp32_rtc_time_get();

  /* Configure wake stub */

  if (esp32_get_deep_sleep_wake_stub() == NULL)
    {
      esp32_set_deep_sleep_wake_stub(esp32_wake_deep_sleep);
    }

  /* Decide which power domains can be powered down */

  pd_flags = esp32_get_power_down_flags();

  /* Correct the sleep time */

  s_config.sleep_time_adjustment = DEEP_SLEEP_TIME_OVERHEAD_US;

  /* Enter deep sleep */

  esp32_sleep_start(RTC_SLEEP_PD_DIG | RTC_SLEEP_PD_VDDSDIO
                              | RTC_SLEEP_PD_XTAL | pd_flags);

  /* Because RTC is in a slower clock domain than the CPU, it
   * can take several CPU cycles for the sleep mode to start.
   */

  while (1);
}

/****************************************************************************
 * Name: esp32_pmsleep
 *
 * Description:
 *   Enter deep sleep.
 *
 * Input Parameters:
 *   time_in_us - deep sleep time interval
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_pmsleep(uint64_t time_in_us)
{
  esp32_sleep_enable_timer_wakeup(time_in_us);
  esp32_deep_sleep_start();
}

/****************************************************************************
 * Name: esp32_pm_lockacquire
 *
 * Description:
 *   Take a power management lock
 *
 ****************************************************************************/

void IRAM_ATTR esp32_pm_lockacquire(void)
{
  ++pm_wakelock;
}

/****************************************************************************
 * Name: esp32_pm_lockrelease
 *
 * Description:
 *   Release the lock taken using esp32_pm_lockacquire.
 *
 ****************************************************************************/

void IRAM_ATTR esp32_pm_lockrelease(void)
{
  --pm_wakelock;
}

/****************************************************************************
 * Name: esp32_pm_lockstatus
 *
 * Description:
 *   Return power management lock status.
 *
 ****************************************************************************/

uint32_t IRAM_ATTR esp32_pm_lockstatus(void)
{
  return pm_wakelock;
}

#endif /* CONFIG_PM */
